// Написать программу вычисления значения функции y=f(sin a)

double sin (double a)
{
    double res = Math.Sin(a);
    return res;
}
Console.WriteLine (sin(0));